Solver/testBoundaryFoam/3UnitTestCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0  0 0)
    (3 0 0)
    (3 1 0)
    (0  1 0)

    (0  0 1)
    (3 0 1)
    (3 1 1)
    (0  1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (3 1 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    empty around
    (
        (3 7 6 2)
        (0 3 2 1)
        (4 5 6 7)
        (1 5 4 0)
    )
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (2 6 5 1)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
